app/Http/Livewire/AdminDashboard.php

    public function render()
    {

        $currentOnline = count(DB::table('sessions')->get());

        $totalUsers = count(User::all());

         //New users -Today
        $newUsers = User::whereDate('created_at', Carbon::today())->count();

         //New Bookings-Today
        $newBookings = Booking::whereDate('created_at', Carbon::today())->count();

         //New Message-Today
        $newMessages = Contact::whereDate('created_at', Carbon::today())->count();

        $totalBookings = count(Booking::all());
---
select * from `users`
select count(*) as aggregate from `users` where date(`created_at`) = '2021-12-04'
select count(*) as aggregate from `booking` where date(`created_at`) = '2021-12-04'
select count(*) as aggregate from `contacts` where date(`created_at`) = '2021-12-04'
select * from `booking`