app/Http/Livewire/ManageBookings.php

    public function render()
    {
        $reservedSymbols = ['-', '+', '<', '>', '@', '(', ')', '~'];
        $term = str_replace($reservedSymbols, '', $this->search);
        $words = explode(' ', $term);

        foreach ($words as $idx => $word) {
            // fulltext indices.
            $words[$idx] = $word;
        }
        $search = implode(' ', $words);

        $keyword = '%' . $this->search . '%';


        $bookings = Booking::with('service')
            ->with('driver')
            ->with('package')
            ->with('delivery')
            ->with('notification')
            ->with('bookingStatus')
            ->with('trackStatus')
            ->where('re_name', 'LIKE', $keyword)
            ->orWhereHas('customer',function($query) use ($keyword){
                return $query
                ->where('name', 'LIKE', $keyword)
                ->orWhere('email', 'LIKE', $keyword)
                ->orWhere('phone', 'LIKE', $keyword)
                ->orWhere('address', 'LIKE', $keyword);
            })
            ->OrWhere('re_name', 'LIKE', $keyword)
            ->OrWhere('re_email', 'LIKE', $keyword)
            ->OrWhere('re_phone', 'LIKE', $keyword)
            ->OrWhere('re_address', 'LIKE', $keyword)
            ->orderByDesc('created_at')
            ->paginate(12);
---
select * from `booking_statuses` where `booking_statuses`.`id` in (1)
select * from `booking` where `re_name` LIKE '%%' or exists (select * from `customer` where `booking`.`customer_id` = `customer`.`id` and (`name` LIKE '%%' or `email` LIKE '%%' or `phone` LIKE '%%' or `address` LIKE '%%')) or `re_name` LIKE '%%' or `re_email` LIKE '%%' or `re_phone` LIKE '%%' or `re_address` LIKE '%%' order by `created_at` desc limit 12 offset 0
select * from `notification` where `notification`.`id` in (1, 2, 3)
select * from `service` where `service`.`id` in (1, 2, 3)