app/Http/Livewire/ManageUsersController.php

    public function render()
    {

        $reservedSymbols = ['-', '+', '<', '>', '@', '(', ')', '~'];
        $term = str_replace($reservedSymbols, '', $this->search);
        $words = explode(' ', $term);

        foreach ($words as $idx => $word) {
            // fulltext indices.
            $words[$idx] = $word;
        }
        $search = implode(' ', $words);

        $keyword = '%' . $this->search . '%';

       $users=  User::whereNotIn('id', [auth()->id()])
        ->where(function($query) use ($keyword) {
            $query->OrWhere('name', 'LIKE', $keyword)
                  ->orWhere('email', 'LIKE', $keyword)
                  ->orWhere('phone', 'LIKE', $keyword);
        })
        ->orderByDesc('created_at')
        ->paginate(12);
---
select * from `users` where `id` not in (1) and (`name` LIKE '%%' or `email` LIKE '%%' or `phone` LIKE '%%') order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `users` where `id` not in (1) and (`name` LIKE '%%' or `email` LIKE '%%' or `phone` LIKE '%%')