app/Http/Livewire/NewBooking.php

select * from `service`
select * from `notification`
select * from `package_type`
---
    public function render()
    {



        //Set Default Value
        if (Auth::check()) {
            $this->state['cname'] = Auth::user()->name;
            $this->state['cemail'] = Auth::user()->email;
            $this->state['cphone'] = Auth::user()->phone;
        }

        $this->sizes = [
            ['name' => '1 KG or Less', 'value' => '1'],
            ['name' => '2 KG or Less', 'value' => '2'],
            ['name' => '3 KG or Less', 'value' => '3'],
            ['name' => '4 KG or Less', 'value' => '4'],
            ['name' => '5 KG or Less', 'value' => '5'],

        ];


        //All Dropdown
        $this->services = Service::all();

        $this->delivery = Delivery::all();

        $this->notifications = Notification::all();

        $this->packageTypes = PackageType::all();