app/Http/Controllers/ManageBookingController.php

    public function edit($id)
    {

        $booking = Booking::findOrFail($id);

        $customer = Customer::find($booking->customer_id);

        //Dropdowns
        $services = Service::all();
        $delivery = Delivery::all();
        $notifications = Notification::all();
        $packageTypes = PackageType::all();
        $bookStatus = BookingStatus::all();
---
select * from `service`
select * from `notification`
select * from `package_type`
select * from `booking_statuses`